Revit 2024 API
PartMakerMethodToDivideVolumes.ProfileOffset Property
 The offset which is applied to a family-defined profile in the direction away from the division line and toward left/upper part to obtain its profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double ProfileOffset { get; set; }
Visual Basic
Public Property ProfileOffset As Double
	Get
	Set
Visual C++
public:
property double ProfileOffset {
	double get ();
	void set (double value);
}
See Also
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace